joyful_journal_app/app/controllers/application_controller.rb

SELECT "journals".* FROM "journals" WHERE "journals"."user_id" = ? ORDER BY "journals"."created_at" DESC LIMIT ?  [["user_id", 4], ["LIMIT", 1]]
---
  def after_sign_in_path_for(resource)
    if resource.is_a?(User)
      last_journal = resource.journals.order(created_at: :desc).first