joyful_journal_app/app/controllers/journals_controller.rb

  def index
    @journals = Journal.where(user_id: current_user.id).order(created_at: :desc)
---
SELECT SUM(happiness_score) FROM "journals" WHERE "journals"."user_id" = ? AND "journals"."created_at" BETWEEN ? AND ?  [["user_id", 4], ["created_at", "2024-06-24 00:00:00"], ["created_at", "2024-06-24 23:59:59.999999"]]
SELECT "journals".* FROM "journals" WHERE "journals"."user_id" = ? ORDER BY "journals"."created_at" DESC  [["user_id", 4]]

  def chart
    c_journals = current_user.journals
    @happiness_data = c_journals.group_by { |journal| journal.created_at.to_date }
                              .transform_values { |journals| journals.map(&:happiness_score).sum / journals.size.to_f }
---
SELECT AVG(happiness_score) FROM "journals" WHERE "journals"."user_id" = ?  [["user_id", 4]]
INSERT INTO "journals" ("content", "stamp", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "スタンプテスト"], ["stamp", "fine"], ["created_at", "2024-06-12 11:13:42.906597"], ["updated_at", "2024-06-12 11:13:42.906597"], ["user_id", 3]]
SELECT "journals".* FROM "journals" WHERE "journals"."user_id" = ?  [["user_id", 4]]

  def create
    @journal = Journal.new(
      content: params[:content],
      user_id: current_user.id,
      stamp: params[:stamp],
    )
    if @journal.save
---
INSERT INTO "journals" ("content", "stamp", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", ""], ["stamp", "depressed"], ["created_at", "2024-06-23 14:04:08.655835"], ["updated_at", "2024-06-23 14:04:08.655835"], ["user_id", 4]]

  def show
    @journal = Journal.find_by(id: params[:id])
---
SELECT "journals".* FROM "journals" WHERE "journals"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]

  def destroy
    @journal = current_user.journals.find(params[:id])
    @journal.destroy
---
SELECT SUM(happiness_score) FROM "journals" WHERE "journals"."user_id" = ? AND "journals"."created_at" BETWEEN ? AND ?  [["user_id", 4], ["created_at", "2024-06-24 00:00:00"], ["created_at", "2024-06-24 23:59:59.999999"]]
SELECT "journals".* FROM "journals" WHERE "journals"."user_id" = ? AND "journals"."id" = ? LIMIT ?  [["user_id", 4], ["id", 31], ["LIMIT", 1]]
DELETE FROM "journals" WHERE "journals"."id" = ?  [["id", 31]]