joyful_journal_app/app/controllers/journals_controller.rb

SELECT "journals".* FROM "journals" WHERE "journals"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def index
    @journals = Journal.where(user_id: current_user.id).order(created_at: :desc)
    @happiness_data = @journals.group_by { |journal| journal.created_at.to_date }
                               .transform_values { |journals| journals.map(&:happiness_score).sum / journals.size.to_f }

INSERT INTO "journals" ("content", "stamp", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "やっぱり今日はいい日だった"], ["stamp", "fine"], ["created_at", "2024-06-26 09:29:10.986979"], ["updated_at", "2024-06-26 09:29:10.986979"], ["user_id", 4]]
SELECT "journals".* FROM "journals" WHERE "journals"."user_id" = ?  [["user_id", 4]]
---
  def chart
    c_journals = current_user.journals
    @happiness_data = c_journals.group_by { |journal| journal.created_at.to_date }
                              .transform_values { |journals| journals.map(&:happiness_score).sum / journals.size.to_f }

INSERT INTO "journals" ("content", "stamp", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "最高の一日だったぜ！"], ["stamp", "fine"], ["created_at", "2024-06-27 08:09:12.976503"], ["updated_at", "2024-06-27 08:09:12.976503"], ["user_id", 4]]
---
  def create
    @journal = Journal.new(
      content: params[:content],
      user_id: current_user.id,
      stamp: params[:stamp],
    )
    if @journal.save